In [12]:
import pandas as pd
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'
df = pd.read_csv(url, sep='\t')
df1 = pd.DataFrame(df)

In [17]:
df1.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [19]:
df1.shape[0]

4622

In [20]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
order_id              4622 non-null int64
quantity              4622 non-null int64
item_name             4622 non-null object
choice_description    3376 non-null object
item_price            4622 non-null object
dtypes: int64(2), object(3)
memory usage: 180.6+ KB

In [21]:
df1.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [22]:
df1.shape[1]

5

In [23]:
df1.index

RangeIndex(start=0, stop=4622, step=1)

In [25]:
#finding out which is the item ordered mostly
c = df1.groupby('item_name')
c = c.sum()
c = c.sort_values(['quantity'], ascending=False)
c.head(5)

                     order_id  quantity
item_name
Chicken Bowl           713926       761
Chicken Burrito        497303       591
Chips and Guacamole    449959       506
Steak Burrito          328437       386
Canned Soft Drink      304753       351

In [26]:
#what was the most ordered item in the choice_description
c = df1.groupby('choice_description').sum()
c = c.sort_values(['quantity'], ascending=False)
c.head(1)

                    order_id  quantity
choice_description
[Diet Coke]           123455       159

In [27]:
#total orders
total_item_orders = df1.quantity.sum()
total_item_orders

4972

In [28]:
#turn the item price type into float
#check the item type
df1.item_price.dtype

dtype('O')

In [30]:
f = lambda x:float(x[1:-1])
item_price = df1.item_price.apply(f)

In [35]:
item_price.dtype

dtype('float64')

In [39]:
#how many order in the period
orders = df1.order_id.value_counts().count()
orders

1834

In [54]:
df1['revenue'] = df1['quantity'] * df1['item_price']
order_grouped = df1.groupby(by=['order_id']).sum()

In [52]:
#how many different items are sold
df1.item_name.value_counts().count()

50

In [56]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
df = pd.read_csv(url, sep='|')
df.head(10)

   user_id  age gender     occupation zip_code
0        1   24      M     technician    85711
1        2   53      F          other    94043
2        3   23      M         writer    32067
3        4   24      M     technician    43537
4        5   33      F          other    15213
5        6   42      M      executive    98101
6        7   57      M  administrator    91344
7        8   36      M  administrator    05201
8        9   29      M        student    01002
9       10   53      M         lawyer    90703

In [57]:
df.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [58]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
user_id       943 non-null int64
age           943 non-null int64
gender        943 non-null object
occupation    943 non-null object
zip_code      943 non-null object
dtypes: int64(2), object(3)
memory usage: 36.9+ KB

In [59]:
df.shape[0]

943

In [60]:
df.shape[1]

5

In [62]:
df.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

In [63]:
df.tail(10)

     user_id  age gender     occupation zip_code
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

In [67]:
type = lambda x:x.dtype
df.apply(type)

user_id       object
age           object
gender        object
occupation    object
zip_code      object
dtype: object

In [68]:
df['occupation'].head()

0    technician
1         other
2        writer
3    technician
4         other
Name: occupation, dtype: object

In [73]:
#how many occupations in it
df.occupation.count()

943

In [82]:
#what is the most frequent occupation
g = df.groupby(by=['occupation']).sum()
g = g.sort_values('user_id', ascending=False)
g.head(5)

               user_id   age
occupation
student          95051  4328
other            56987  3625
educator         44356  3991
administrator    34045  3061
engineer         30574  2438

In [76]:
age_grouped = df.groupby('age').mean()

In [85]:
age_grouped.sort_values('age',ascending=False).head(5)

     user_id
age
73     481.0
70     810.0
69     572.0
68     461.0
66     211.0

In [86]:
#what is the age with least occurences
age_grouped.sort_values('age',ascending=True).head(1)

     user_id
age
7       30.0